Nealcn/stopwatch-N/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# main 任务栈 4KB（8KB 冗余，Opus 编码器需内部 RAM）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_CACHE_DEF_SIZE=1048576
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=2
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=65
CONFIG_LV_FS_STDIO_CACHE_SIZE=1048576
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_TJPGD=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_SMARTWATCH=y

# --- BLE (VoiceCube 桌面模式, 阶段二) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# NimBLE host 栈 8KB：默认 4KB 在 GATT 订阅回调 + 日志格式化时会栈溢出（设备重启）
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
# NimBLE 内存放 PSRAM：内部 RAM 需留给 Opus 编码器（43KB，PSRAM 上的编码器
# 密集读写会触发 cache 卡死 → WDT 复位，参考原 VoiceCube 工程经验）
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# --- 内存与看门狗（参考原 VoiceCube 工程 sdkconfig.defaults 的踩坑经验） ---
# WiFi 缓冲进 PSRAM，腾出内部 RAM
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# 小分配不再强制内部 RAM（16KB → 4KB）
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# DMA 保留区 32KB → 16KB（腾内部 RAM 给 Opus 编码器；I2S/BT DMA 缓冲 16KB 足够）
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384
# 允许任务栈放 PSRAM（录音任务 24KB 栈进 PSRAM，内部 RAM 留给 Opus 编码器）
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
# 中断看门狗关闭：录音/编码时短时卡顿不误复位（原版经验）
CONFIG_ESP_INT_WDT=n
# 任务看门狗超时放宽到 30s（原版经验，长录音不被误杀）
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
# Brownout 电平 5 代替 7（原版注释：防止录音时 USB 供电波动误复位）
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5=y
CONFIG_ESP32S3_BROWNOUT_DET_LVL_SEL_5=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=n
CONFIG_ESP32S3_BROWNOUT_DET_LVL_SEL_7=n

# --- TLS (小智 AI 对话, 阶段三: esp-ml307 EspNetwork 的 wss/https) ---
CONFIG_ESP_TLS_USE_BUNDLE=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
